import { parseMenuText } from './src/utils/advancedMenuParser';
import fs from 'fs';

const menu1 = `Меню за 09.04.2026 

Основно ястие:
- Кюфтета по цариградски 3.20€
- Пекан боб 2.70€
- Пилешко филе в гъбен сос 3.40€
- Свинско с лук 3.20€
- Гъби с ориз 2.70€
- Пиле с ориз 3.00€
- Надупени картофи 2.70€
- Пилешки крилца с гарнитура 3.20€
- Хрупкаво пилешко филе с гарнитура 3.60€
- Свински шницел с гарнитура 3.40€




Хляб:
- Четвъртинка хляб 0.50€






Супи:
- Пилешка супа 1.80€
- Шкембе 1.80€
- Таратор 1.50€ 

Салати:
200гр 1.50€ + 0.10€ кутийка
- Шопска салата
- Зелева салата
- Млечна салата


Гарнитури :
100гр 0.75€ ( 0.10€ кутийка ако е отделно)
- Шопска салата
- Зелева салата
- Млечна салата
- Картофи по селски
- Пържени картофи 


Скара:
0.10€ кутийка
- Кебапче 100гр 1.00€
- Кюфте 100гр 1.00€
- Телешко кюфте 100гр 1.00€
- Татарско кюфте с гарнитура 3.40€
- Сръбска плескавица с гарнитура 3.40€










Десерт:
- Домашна бисквитена торта 1.80€`;

const menu2 = `Меню за 27.04.26

Супи:
*Пилешка супа -1.70
*Шкембе чорба- 1.80
*Агнешка дроб чорба-1.80
*Леща-1.50
*Крем супа-1.50

Салати: 0.100гр - 0.67е.
*Млечна салата
*Шопска салата
*Катък с червена чушка
*Картофена салата
*Зеле с моркови

Скара:
*Кебапче -0.85
*Кюфте -0.85
*Пилешко шишче-2.00
*Свинско шишче-2.00
*Татарско кюфте с гарнитура-3.00
*Карначе с манатарки и гарнитура-3.40
*Телешко карначе с гарнитура-3.60

Основни ястия:
*Миш маш -2.60
*Свински гювеч-3.20
*Пилешко филе в 4 вида сирена-3.60
*Свинско със спанак и ориз-3.20
*Пилешка кавърма-3.10
*Огретен със сирене и сметана-2.60
*Агнешка дроб сарма-3.10
*Мусака-3.00
*Телешки кюфтета с грах-3.60
*Лазаня-3.00
*Пиле със задушени картофи-2.80
*Кашкавал пане с гарнитура-3.10
*Пържено кюфте -0.85

Десерти:
*Мляко с ориз -1.00

Цена за кутийка -0.10е

Цена за доставка до Импрес -7евро

Заповядайте при нас! Готвено с вкус от старо време!`;

console.log("MENU 1:");
console.dir(parseMenuText(menu1), { depth: null });
console.log("\nMENU 2:");
console.dir(parseMenuText(menu2), { depth: null });
